Work.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: overview
#+Title: [[https://github.com/zeusdeux/zeit-graphql][Zeit APIs over GraphQL]]

* GETs [3/19]
** DONE [[https://zeit.co/docs/api/#endpoints/deployments/list-deployments][List Deployments]]
   - State "DONE"       from "INPROGRESS" [2019-03-14 Thu 17:20]
   - State "INPROGRESS" from "TODO"       [2019-03-12 Tue 15:30]
   ~GET /v3/now/deployments~
** DONE [[https://zeit.co/docs/api/#endpoints/deployments/get-a-single-deployment][Get a Single Deployment]]
   - State "DONE"       from "INPROGRESS" [2019-03-16 Sat 03:53]
   - State "INPROGRESS" from "TODO"       [2019-03-16 Sat 02:17]
   ~GET /v6/now/deployments/:id~
** DONE [[https://zeit.co/docs/api/#endpoints/deployments/list-deployment-files][List Deployment Files]]
   - State "DONE"       from "INPROGRESS" [2019-03-17 Sun 18:41]
   - State "INPROGRESS" from "TODO"       [2019-03-17 Sun 16:57]
   ~GET /v5/now/deployments/:id/files~
** TODO [[https://zeit.co/docs/api/#endpoints/deployments/get-single-file-contents][Get Single File Contents]]
   ~GET /v5/now/deployments/:id/files/:fileId~
** TODO [[https://zeit.co/docs/api/#endpoints/deployments/list-builds][List Builds]]
   ~GET /v5/now/deployments/:id/builds~
** TODO [[https://zeit.co/docs/api/#endpoints/logs/get-deployment-logs][Get Deployment Logs]]
   ~GET /v2/now/deployments/:id/events~
** TODO [[https://zeit.co/docs/api/#endpoints/domains/list-all-the-domains][List all the Domains]]
   ~GET /v4/domains~
** TODO [[https://zeit.co/docs/api/#endpoints/domains/check-a-domain-availability][Check a Domain availability]]
   ~GET /v4/domains/status?name~
** TODO [[https://zeit.co/docs/api/#endpoints/domains/check-the-price-of-a-domain][Check the price of a domain]]
   ~GET /v4/domains/price?name~
** TODO [[https://zeit.co/docs/api/#endpoints/dns/list-all-the-dns-records-of-a-domain][List all the DNS records of a domain]]
   ~GET /v2/domains/:domain/records~
** TODO [[https://zeit.co/docs/api/#endpoints/certificates/list-all-the-certificates][List all the certificates]]
   ~GET /v3/now/certs~
** TODO [[https://zeit.co/docs/api/#endpoints/certificates/get-a-single-certificate][Get a single certificate]]
   ~GET /v3/now/certs/:id~
** TODO [[https://zeit.co/docs/api/#endpoints/aliases/list-all-the-aliases][List all the aliases]]
   ~GET /v2/now/aliases~
** TODO [[https://zeit.co/docs/api/#endpoints/aliases/list-aliases-by-deployment][List aliases by deployment]]
   ~GET /v2/now/deployments/:id/aliases~
** TODO [[https://zeit.co/docs/api/#endpoints/secrets/list-all-the-secrets][List all the secrets]]
   ~GET /v2/now/secrets~
** TODO [[https://zeit.co/docs/api/#endpoints/teams/list-all-your-teams][List all your teams]]
   ~GET /v1/teams~
** TODO [[https://zeit.co/docs/api/#endpoints/teams/get-single-team-information][Get single team information]]
   ~GET /v1/teams/:id~
   ~GET /v1/teams?slug~
** TODO [[https://zeit.co/docs/api/#endpoints/teams/get-list-of-team-members][Get list of team members]]
   ~GET /v1/teams/:id/members~
** TODO [[https://zeit.co/docs/api/#endpoints/authentication/verify-loginv][Verify login]]
   ~GET /now/registration/verify?email&token~

* Misc [3/3]
** DONE Refactor [[file:api/schema.ts][schema.ts]]
   - State "DONE"       from "INPROGRESS" [2019-03-17 Sun 15:25]
   - State "INPROGRESS" from "TODO"       [2019-03-17 Sun 14:20]
   - into files that combine typedefs and resolvers for related things
     such as deployment.ts that has everything for deployment and
     deployments

** DONE Enable introspection in prod based on env
   - State "DONE"       from "INPROGRESS" [2019-03-17 Sun 15:45]
   - State "INPROGRESS" from "TODO"       [2019-03-17 Sun 15:40]
** DONE Mask errors and match Zeit api [[https://zeit.co/docs/api/#api-basics/errors][errors schema]]
   - State "DONE"       from "INPROGRESS" [2019-03-17 Sun 16:02]
   - State "INPROGRESS" from "TODO"       [2019-03-17 Sun 15:45]
