Work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-17 Sun 16:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><a href="https://github.com/zeusdeux/zeit-graphql">Zeit APIs over GraphQL</a></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mudit Ameta" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title"><a href="https://github.com/zeusdeux/zeit-graphql">Zeit APIs over GraphQL</a></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc84d019">1. GETs <code>[2/19]</code></a>
<ul>
<li><a href="#org2461916">1.1. <span class="done DONE">DONE</span> List Deployments</a></li>
<li><a href="#org46d7944">1.2. <span class="done DONE">DONE</span> Get a Single Deployment</a></li>
<li><a href="#org2262d6f">1.3. <span class="todo TODO">TODO</span> List Deployment Files</a></li>
<li><a href="#orgb670319">1.4. <span class="todo TODO">TODO</span> Get Single File Contents</a></li>
<li><a href="#org673e57b">1.5. <span class="todo TODO">TODO</span> List Builds</a></li>
<li><a href="#orge2cc44f">1.6. <span class="todo TODO">TODO</span> Get Deployment Logs</a></li>
<li><a href="#org057def2">1.7. <span class="todo TODO">TODO</span> List all the Domains</a></li>
<li><a href="#org804355c">1.8. <span class="todo TODO">TODO</span> Check a Domain availability</a></li>
<li><a href="#orgff306bf">1.9. <span class="todo TODO">TODO</span> Check the price of a domain</a></li>
<li><a href="#org5c22a15">1.10. <span class="todo TODO">TODO</span> List all the DNS records of a domain</a></li>
<li><a href="#org3e67f67">1.11. <span class="todo TODO">TODO</span> List all the certificates</a></li>
<li><a href="#org5b4f4f6">1.12. <span class="todo TODO">TODO</span> Get a single certificate</a></li>
<li><a href="#org3dbe18e">1.13. <span class="todo TODO">TODO</span> List all the aliases</a></li>
<li><a href="#org68c0ad6">1.14. <span class="todo TODO">TODO</span> List aliases by deployment</a></li>
<li><a href="#org4f13e00">1.15. <span class="todo TODO">TODO</span> List all the secrets</a></li>
<li><a href="#orgd1e790d">1.16. <span class="todo TODO">TODO</span> List all your teams</a></li>
<li><a href="#orgf53e430">1.17. <span class="todo TODO">TODO</span> Get single team information</a></li>
<li><a href="#org3dc9868">1.18. <span class="todo TODO">TODO</span> Get list of team members</a></li>
<li><a href="#orga187c62">1.19. <span class="todo TODO">TODO</span> Verify login</a></li>
</ul>
</li>
<li><a href="#org050f4bf">2. Misc <code>[3/3]</code></a>
<ul>
<li><a href="#org2a62c06">2.1. <span class="done DONE">DONE</span> Refactor schema.ts</a></li>
<li><a href="#org8fe9bb8">2.2. <span class="done DONE">DONE</span> Enable introspection in prod based on env</a></li>
<li><a href="#orgb20f28d">2.3. <span class="done DONE">DONE</span> Mask errors and match Zeit api errors schema</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc84d019" class="outline-2">
<h2 id="orgc84d019"><span class="section-number-2">1</span> GETs <code>[2/19]</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2461916" class="outline-3">
<h3 id="org2461916"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> <a href="https://zeit.co/docs/api/#endpoints/deployments/list-deployments">List Deployments</a></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>State "DONE"       from "INPROGRESS" <span class="timestamp-wrapper"><span class="timestamp">[2019-03-14 Thu 17:20]</span></span></li>
<li>State "INPROGRESS" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-03-12 Tue 15:30]</span></span></li>
</ul>
<p>
<code>GET /v3/now/deployments</code>
</p>
</div>
</div>
<div id="outline-container-org46d7944" class="outline-3">
<h3 id="org46d7944"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> <a href="https://zeit.co/docs/api/#endpoints/deployments/get-a-single-deployment">Get a Single Deployment</a></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>State "DONE"       from "INPROGRESS" <span class="timestamp-wrapper"><span class="timestamp">[2019-03-16 Sat 03:53]</span></span></li>
<li>State "INPROGRESS" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-03-16 Sat 02:17]</span></span></li>
</ul>
<p>
<code>GET /v6/now/deployments/:id</code>
</p>
</div>
</div>
<div id="outline-container-org2262d6f" class="outline-3">
<h3 id="org2262d6f"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/deployments/list-deployment-files">List Deployment Files</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>GET /v5/now/deployments/:id/files</code>
</p>
</div>
</div>
<div id="outline-container-orgb670319" class="outline-3">
<h3 id="orgb670319"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/deployments/get-single-file-contents">Get Single File Contents</a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>GET /v5/now/deployments/:id/files/:fileId</code>
</p>
</div>
</div>
<div id="outline-container-org673e57b" class="outline-3">
<h3 id="org673e57b"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/deployments/list-builds">List Builds</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>GET /v5/now/deployments/:id/builds</code>
</p>
</div>
</div>
<div id="outline-container-orge2cc44f" class="outline-3">
<h3 id="orge2cc44f"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/logs/get-deployment-logs">Get Deployment Logs</a></h3>
<div class="outline-text-3" id="text-1-6">
<p>
<code>GET /v2/now/deployments/:id/events</code>
</p>
</div>
</div>
<div id="outline-container-org057def2" class="outline-3">
<h3 id="org057def2"><span class="section-number-3">1.7</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/domains/list-all-the-domains">List all the Domains</a></h3>
<div class="outline-text-3" id="text-1-7">
<p>
<code>GET /v4/domains</code>
</p>
</div>
</div>
<div id="outline-container-org804355c" class="outline-3">
<h3 id="org804355c"><span class="section-number-3">1.8</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/domains/check-a-domain-availability">Check a Domain availability</a></h3>
<div class="outline-text-3" id="text-1-8">
<p>
<code>GET /v4/domains/status?name</code>
</p>
</div>
</div>
<div id="outline-container-orgff306bf" class="outline-3">
<h3 id="orgff306bf"><span class="section-number-3">1.9</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/domains/check-the-price-of-a-domain">Check the price of a domain</a></h3>
<div class="outline-text-3" id="text-1-9">
<p>
<code>GET /v4/domains/price?name</code>
</p>
</div>
</div>
<div id="outline-container-org5c22a15" class="outline-3">
<h3 id="org5c22a15"><span class="section-number-3">1.10</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/dns/list-all-the-dns-records-of-a-domain">List all the DNS records of a domain</a></h3>
<div class="outline-text-3" id="text-1-10">
<p>
<code>GET /v2/domains/:domain/records</code>
</p>
</div>
</div>
<div id="outline-container-org3e67f67" class="outline-3">
<h3 id="org3e67f67"><span class="section-number-3">1.11</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/certificates/list-all-the-certificates">List all the certificates</a></h3>
<div class="outline-text-3" id="text-1-11">
<p>
<code>GET /v3/now/certs</code>
</p>
</div>
</div>
<div id="outline-container-org5b4f4f6" class="outline-3">
<h3 id="org5b4f4f6"><span class="section-number-3">1.12</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/certificates/get-a-single-certificate">Get a single certificate</a></h3>
<div class="outline-text-3" id="text-1-12">
<p>
<code>GET /v3/now/certs/:id</code>
</p>
</div>
</div>
<div id="outline-container-org3dbe18e" class="outline-3">
<h3 id="org3dbe18e"><span class="section-number-3">1.13</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/aliases/list-all-the-aliases">List all the aliases</a></h3>
<div class="outline-text-3" id="text-1-13">
<p>
<code>GET /v2/now/aliases</code>
</p>
</div>
</div>
<div id="outline-container-org68c0ad6" class="outline-3">
<h3 id="org68c0ad6"><span class="section-number-3">1.14</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/aliases/list-aliases-by-deployment">List aliases by deployment</a></h3>
<div class="outline-text-3" id="text-1-14">
<p>
<code>GET /v2/now/deployments/:id/aliases</code>
</p>
</div>
</div>
<div id="outline-container-org4f13e00" class="outline-3">
<h3 id="org4f13e00"><span class="section-number-3">1.15</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/secrets/list-all-the-secrets">List all the secrets</a></h3>
<div class="outline-text-3" id="text-1-15">
<p>
<code>GET /v2/now/secrets</code>
</p>
</div>
</div>
<div id="outline-container-orgd1e790d" class="outline-3">
<h3 id="orgd1e790d"><span class="section-number-3">1.16</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/teams/list-all-your-teams">List all your teams</a></h3>
<div class="outline-text-3" id="text-1-16">
<p>
<code>GET /v1/teams</code>
</p>
</div>
</div>
<div id="outline-container-orgf53e430" class="outline-3">
<h3 id="orgf53e430"><span class="section-number-3">1.17</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/teams/get-single-team-information">Get single team information</a></h3>
<div class="outline-text-3" id="text-1-17">
<p>
<code>GET /v1/teams/:id</code>
<code>GET /v1/teams?slug</code>
</p>
</div>
</div>
<div id="outline-container-org3dc9868" class="outline-3">
<h3 id="org3dc9868"><span class="section-number-3">1.18</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/teams/get-list-of-team-members">Get list of team members</a></h3>
<div class="outline-text-3" id="text-1-18">
<p>
<code>GET /v1/teams/:id/members</code>
</p>
</div>
</div>
<div id="outline-container-orga187c62" class="outline-3">
<h3 id="orga187c62"><span class="section-number-3">1.19</span> <span class="todo TODO">TODO</span> <a href="https://zeit.co/docs/api/#endpoints/authentication/verify-loginv">Verify login</a></h3>
<div class="outline-text-3" id="text-1-19">
<p>
<code>GET /now/registration/verify?email&amp;token</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org050f4bf" class="outline-2">
<h2 id="org050f4bf"><span class="section-number-2">2</span> Misc <code>[3/3]</code></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2a62c06" class="outline-3">
<h3 id="org2a62c06"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Refactor <a href="api/schema.ts">schema.ts</a></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>State "DONE"       from "INPROGRESS" <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 15:25]</span></span></li>
<li>State "INPROGRESS" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 14:20]</span></span></li>
<li>into files that combine typedefs and resolvers for related things
such as deployment.ts that has everything for deployment and
deployments</li>
</ul>
</div>
</div>

<div id="outline-container-org8fe9bb8" class="outline-3">
<h3 id="org8fe9bb8"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Enable introspection in prod based on env</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>State "DONE"       from "INPROGRESS" <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 15:45]</span></span></li>
<li>State "INPROGRESS" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 15:40]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgb20f28d" class="outline-3">
<h3 id="orgb20f28d"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Mask errors and match Zeit api <a href="https://zeit.co/docs/api/#api-basics/errors">errors schema</a></h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>State "DONE"       from "INPROGRESS" <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 16:02]</span></span></li>
<li>State "INPROGRESS" from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-03-17 Sun 15:45]</span></span></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
